# Создайте модуль с функцией внутри.
# Функция принимает на вход три целых числа:
# нижнюю и верхнюю границу и количество попыток.
# Внутри генерируется случайное число в указанных
# границах и пользователь должен угадать его за заданное число попыток.
# Функция выводит подсказки “больше” и “меньше”. Если число угадано,
# возвращается истина, а если попытки исчерпаны - ложь.

# Улучшаем задачу 2. Добавьте возможность запуска функции
# “угадайки” из модуля в командной строке терминала.
# Строка должна принимать от 1 до 3 аргументов:
# параметры вызова функции.
# Для преобразования строковых аргументов
# командной строки в числовые параметры используйте генераторное выражение.

from random import randint
from sys import argv


__all__ = ['guessing_function']


def guessing_function(start: int, stop: int, tries: int) -> bool:
    """Функция принимает на вход три целых числа:
       нижнюю и верхнюю границу и количество попыток.
       Внутри генерируется случайное число в указанных
       границах и пользователь должен угадать его за заданное число попыток."""

    random_num = randint(start, stop)
    while tries > 0:
        usr_try = int(input('Число: '))
        if usr_try > random_num:
            print('Меньше')
        elif usr_try < random_num:
            print('Больше')
        else:
            print('Угадали')
            return True
        tries -= 1
    return False


if __name__ == '__main__':
    FIRST_ARG = 1
    LAST_ARG = 4
    start_range, end_range, tries_count = tuple(map(int, argv[FIRST_ARG:LAST_ARG]))
    print(guessing_function(start_range, end_range, tries_count))
